Case3FromMiaoWang/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1.461e-05;
//nu              nu [ 0 2 -1 0 0 0 0 ] 0.895e-04;

// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 3.333e-03;

// Reference temperature
TRef            TRef [0 0 0 1 0 0 0] 300;

// Laminar Prandtl number
//Pr              Pr [0 0 0 0 0 0 0] 0.9;
Pr              Pr [0 0 0 0 0 0 0] 0.744;

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 0.9;
// ************************************************************************* //

// Cp0 value needed for wallHeatFluxIncompressible
rho0             rho0 [1 -3 0 0 0 0 0] 1.225;

// rho0 value needed for wallHeatFluxIncompressible
Cp0             Cp0 [0 2 -2 -1 0 0 0] 1006.43;
