Case3FromMiaoWang/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 301.15;

boundaryField
{
    Diffuser
    {
        type            fixedValue;
        value           uniform 295.35;
    }
    Exhaust
    {
        type            zeroGradient;
    }
    Box_north
    {
        type            fixedValue;
        value           uniform 308.145;
    }
    Box_south
    {
        type            fixedValue;
		value 			uniform 308.664;
    }
    Box_east
    {
        type            fixedValue;
		value 			uniform 309.424;
    }
    Box_west
    {
        type            fixedValue;
		value 			uniform 309.583;
    }
    Box_top
    {
        type            fixedValue;
		value 			uniform 307.783;
    }
    Ceiling
    {
        type            fixedValue;
		value 			uniform 299.09091;
    }
    Floor
    {
        type            fixedValue;
		value 			uniform 300.2381;
    }
    North_wall
    {
        type            fixedValue;
		value 			uniform 300.07645;
    }
    East_wall
    {
        type            fixedValue;
		value 			uniform 301.51465;
    }
    South_wall
    {
        type            fixedValue;
		value 			uniform 300.50568;
    }	
    West_wall
    {
        type            fixedValue;
		value 			uniform 300.5;
    }

}

// ************************************************************************* //
