Case3FromMiaoWang/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat raw;

sets
(
    p1
    {
        type        uniform;
        axis        distance;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (0.2286 0 1.22);
        end         (0.2286 2.44 1.22);
        nPoints     100;
    }

    p2
    {
        type        uniform;
        axis        distance;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (0.6858 0 1.22);
        end         (0.6858 2.44 1.22);
        nPoints     100;
    }

    p3
    {
        type        uniform;
        axis        distance;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (1.143 0 1.22);
        end         (1.143 2.44 1.22);
        nPoints     100;
    }

    p4
    {
        type        uniform;
        axis        distance;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (1.6002 0 1.22);
        end         (1.6002 2.44 1.22);
        nPoints     100;
    }

    p5
    {
        type        uniform;
        axis        distance;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (2.0574 0 1.22);
        end         (2.0574 2.44 1.22);
        nPoints     100;
    }

    p6
    {
        type        uniform;
        axis        distance;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (1.22 0 0.2286);
        end         (1.22 2.44 0.2286);
        nPoints     100;
    }

    somePoints
    {
        type    cloud;
        axis    xyz;
...
    }
);

surfaces
(
    constantPlane
    {
        type            plane;    // always triangulated
        basePoint       (1.22 1.22 1.22);
        normalVector    (0 0 1);

        //- Optional: restrict to a particular zone
        // zone        zone1;
    }
);

fields
(
    U
	T
    k
);


// ************************************************************************* //
